2. Entendiendo la data de eventos

In [2]:
import pandas as pd
import duckdb

In [3]:
event_df = pd.read_csv("events.csv")

In [4]:
event_df.head()

       timestamp  visitorid event  itemid  transactionid
0  1433221332117     257597  view  355908            NaN
1  1433224214164     992329  view  248676            NaN
2  1433221999827     111016  view  318965            NaN
3  1433221955914     483717  view  253185            NaN
4  1433221337106     951259  view  367447            NaN

In [5]:
event_df[event_df["transactionid"].notna()].head()

         timestamp  visitorid        event  itemid  transactionid
130  1433222276276     599528  transaction  356475         4000.0
304  1433193500981     121688  transaction   15335        11117.0
418  1433193915008     552148  transaction   81345         5444.0
814  1433176736375     102019  transaction  150318        13556.0
843  1433174518180     189384  transaction  310791         7244.0

3. Trabajando con SQLDF

In [6]:
mysql("""
    SELECT
        visitorid
        ,MAX(CASE WHEN event = 'view' THEN 1 ELSE 0 END) views
        ,MAX(CASE WHEN event = 'addtocart' THEN 1 ELSE 0 END) cart
        ,MAX(CASE WHEN event = 'transaction' THEN 1 ELSE 0 END) txn
        FROM event_df
        GROUP BY 1

""")

NameError: name 'mysql' is not defined